### 0. Library

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns
sns.set(style='darkgrid')
from scipy import stats
import warnings
warnings.filterwarnings("ignore")

In [2]:
df = pd.read_csv('titanic.csv')

### 1. What is the dimension (col, row) of the data frame?

In [4]:
df.shape

(887, 8)

### 2. How to know data type of each variable?

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 887 entries, 0 to 886
Data columns (total 8 columns):
Survived                   887 non-null int64
Pclass                     887 non-null int64
Name                       887 non-null object
Sex                        887 non-null object
Age                        887 non-null float64
Siblings/Spouses Aboard    887 non-null int64
Parents/Children Aboard    887 non-null int64
Fare                       887 non-null float64
dtypes: float64(2), int64(4), object(2)
memory usage: 55.6+ KB

### 3. How many passengers survived (Survived=1) and not-survived (Survived=0)?

In [13]:
df.Survived.value_counts()

0    545
1    342
Name: Survived, dtype: int64

### 4. How to drop column ‘Name’ from the data frame?

In [15]:
df.drop('Name',axis=1)

,Survived,Pclass,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,male,22.0,1,0,7.2500
1,1,1,female,38.0,1,0,71.2833
2,1,3,female,26.0,0,0,7.9250
3,1,1,female,35.0,1,0,53.1000
4,0,3,male,35.0,0,0,8.0500
...,...,...,...,...,...,...,...
882,0,2,male,27.0,0,0,13.0000
883,1,1,female,19.0,0,0,30.0000
884,0,3,female,7.0,1,2,23.4500
885,1,1,male,26.0,0,0,30.0000
886,0,3,male,32.0,0,0,7.7500

### 5. Add one new column called ‘family’ to represent number of family-member aboard (hint: family = sibsp + parch)

In [17]:
df['family'] = df['Siblings/Spouses Aboard'] + df['Parents/Children Aboard']

###  6. As shown, columns ‘Age’ contains missing values. Please add new column named ‘Age_miss’ to indicate whether Age is missing or not (Age_miss = ‘YES’ for missing value and ‘NO’ for non-missing value).

In [34]:
arr = []
for i in range(len(df)):
    if(df['Age'][i] is None):
        arr.append('YES')
    else:
        arr.append('NO')
df['Age_miss'] = arr

### 7. Please fill Age missing value with means of existing Age values

In [36]:
df.Age.isnull().sum()

0

On the data, there is no null 'Age' in data. So we dont need to fill the missing age.

### 8. What is the maximum passenger Age who survived from the tragedy?

In [45]:
df2 = df[df['Survived']==1]

In [48]:
df2['Age'].max()

80.0

### 9. How many passengers survived from each ‘PClass’?

In [59]:
df2.groupby('Pclass').count()[['Name']]

        Name
Pclass
1        216
2        184
3        487

### 10. How to randomly split the data frame into 2 parts (titanic1 and titanic2) with proportion of 0.7 for tttanic1 and 0.3 for titanic2 ?

In [65]:
lentitanic = round(0.7 * len(df))

titanic1 = df[:lentitanic]
titanic2 = df[lentitanic:]